valid/sandia_valid/SandiaD_LTS_accelerint/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}

chemistryType
{
    solver          batched;
    method          batchedIPM;
}

chemistry       on;

initialChemicalTimeStep 1e-07;

odeCoeffs
{
    absTol          1e-10;
    relTol          1e-06;
    solver          AccelerInt;
    accSolver       ROS4;
    vectorSize      8;
    platform        intel;
}

// ************************************************************************* //
